luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSbcu_regdef.h
/** \brief  SBCU Error Address Capture Register */
typedef struct _Ifx_SBCU_EADD_Bits
{
    unsigned int FPIADR:32;                 /**< \brief [31:0] Captured FPI Bus Address (rwh) */
} Ifx_SBCU_EADD_Bits;

/** \brief  SBCU Error Control Capture Register */
typedef struct _Ifx_SBCU_ECON_Bits
{
    unsigned int ERRCNT:14;                 /**< \brief [13:0] FPI Bus Error Counter (rwh) */
    unsigned int TOUT:1;                    /**< \brief [14:14] State of FPI Bus Time-Out Signal (rwh) */
    unsigned int RDY:1;                     /**< \brief [15:15] State of FPI Bus Ready Signal (rwh) */
    unsigned int ABT:1;                     /**< \brief [16:16] State of FPI Bus Abort Signal (rwh) */
    unsigned int ACK:2;                     /**< \brief [18:17] State of FPI Bus Acknowledge Signals (rwh) */
    unsigned int SVM:1;                     /**< \brief [19:19] State of FPI Bus Supervisor Mode Signal (rwh) */
    unsigned int WRN:1;                     /**< \brief [20:20] State of FPI Bus Write Signal (rwh) */
    unsigned int RDN:1;                     /**< \brief [21:21] State of FPI Bus Read Signal (rwh) */
    unsigned int TAG:6;                     /**< \brief [27:22] FPI Bus Master Tag Number Signals (rwh) */
    unsigned int OPC:4;                     /**< \brief [31:28] FPI Bus Operation Code Signals (rwh) */
} Ifx_SBCU_ECON_Bits;

/** \brief  SBCU Error Data Capture Register */
typedef struct _Ifx_SBCU_EDAT_Bits
{
    unsigned int FPIDAT:32;                 /**< \brief [31:0] Captured FPI Bus Data (rwh) */
} Ifx_SBCU_EDAT_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_SBCU_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODNUMBER:8;               /**< \brief [15:8] Module Number Value (r) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SBCU_ID_Bits;

/** \brief  Arbiter Priority Register High */
typedef struct _Ifx_SBCU_PRIOH_Bits
{
    unsigned int CPU1:4;                    /**< \brief [3:0] Master 8 Priority (rw) */
    unsigned int CPU2:4;                    /**< \brief [7:4] Master 9 Priority (rw) */
    unsigned int RESERVEDA:4;               /**< \brief [11:8] Reserved (rw) */
    unsigned int RESERVEDB:4;               /**< \brief [15:12] Reserved (rw) */
    unsigned int HSMRMI:4;                  /**< \brief [19:16] Master 12 Priority (rw) */
    unsigned int HSMCMI:4;                  /**< \brief [23:20] Master 13 Priority (rw) */
    unsigned int RESERVEDE:4;               /**< \brief [27:24] Reserved (rw) */
    unsigned int DMAL:4;                    /**< \brief [31:28] Master 15 Priority (rw) */
} Ifx_SBCU_PRIOH_Bits;

/** \brief  Arbiter Priority Register Low */
typedef struct _Ifx_SBCU_PRIOL_Bits
{
    unsigned int DMAH:4;                    /**< \brief [3:0] Master 0 Priority (rw) */
    unsigned int RESERVED1:4;               /**< \brief [7:4] Reserved (rw) */
    unsigned int ETH:4;                     /**< \brief [11:8] Master 2 Priority (rw) */
    unsigned int HSSL:4;                    /**< \brief [15:12] Master 3 Priority (rw) */
    unsigned int RESERVED4:4;               /**< \brief [19:16] Reserved (rw) */
    unsigned int DMAM:4;                    /**< \brief [23:20] Master 5 Priority (rw) */
    unsigned int RESERVED6:4;               /**< \brief [27:24] Reserved (rw) */
    unsigned int CPU0:4;                    /**< \brief [31:28] Master 7 Priority (rw) */
} Ifx_SBCU_PRIOL_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sbcu_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_ACCEN0_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_ACCEN1;

/** \brief  SBCU Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_CON_Bits B;                    /**< \brief Bitfield access */
} Ifx_SBCU_CON;

/** \brief  SBCU Debug Address 1 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBADR1_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_DBADR1;

/** \brief  SBCU Debug Address 2 Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBADR2_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_DBADR2;

/** \brief  SBCU Debug Trapped Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBADRT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_DBADRT;

/** \brief  SBCU Debug Bus Operation Signals Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBBOS_Bits B;                  /**< \brief Bitfield access */
} Ifx_SBCU_DBBOS;

/** \brief  SBCU Debug Trapped Bus Operation Signals Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBBOST_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_DBBOST;

/** \brief  SBCU Debug Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBCNTL_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_DBCNTL;

/** \brief  SBCU Debug Data Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBDAT_Bits B;                  /**< \brief Bitfield access */
} Ifx_SBCU_DBDAT;

/** \brief  SBCU Debug Trapped Master Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBGNTT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_DBGNTT;

/** \brief  SBCU Debug Grant Mask Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SBCU_DBGRNT_Bits B;                 /**< \brief Bitfield access */
} Ifx_SBCU_DBGRNT;

